app/controllers/movies_controller.rb

  def add_tmdb #method to add movies to tmdb
    @movies_to_add = (params[:tmdb_movies])

    if @movies_to_add == nil
      flash[:notice] = "No movies were selected."
    else
      flash[:notice] = "Movies added to database."
      @movies_to_add.each do |movie| #for all movies in the hash
        Movie.create_from_tmdb(movie[0]) #call Movie model method, passing tmdb_id
---
INSERT INTO "movies" ("created_at", "description", "rating", "release_date", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Mon, 21 Oct 2013 05:10:51 UTC +00:00], ["description", nil], ["rating", nil], ["release_date", nil], ["title", nil], ["updated_at", Mon, 21 Oct 2013 05:10:51 UTC +00:00]]